Repository: GabbenPapa/Flutter-game-launcher
Catalog: lib/l10n/app_*.arb
Languages: de, hu

# game_launcher_title
source: Game Launcher
de: Spielstarter
hu: Játékgyüjtő

source: You rolled
de: Du hast gewürfelt
hu: Dobtál

source: Rolling...
de: Würfeln...
hu: Dobás...

source: Roll Dice
de: Würfeln
hu: Eldob

source: Settings
de: Einstellungen
hu: Beállítások

source: Home
de: Startseite
hu: Kezőlap

source: Player 1
de: Spieler 1
hu: Játékos 1

source: Score:
de: Punktzahl:
hu: Pontszám:

source: Current:
de: Aktuell:
hu: Jelenlegi:

source: Player 2
de: Spieler 2
hu: Játékos 2

source: Hold
de: Halten
hu: Megtart

# winnerTitle
source: Winner, Winner, Chicken Dinner!
de: Gewinner, Gewinner, Hähnchenabend!
hu: Nyertes, Nyertes, Csirke vacsora!

# winnerMessage
source: {playerNumber} wins the game!
de: Spieler {playerNumber} hat das Spiel gewonnen!
hu: {playerNumber} játékos nyerte meg a játékot!

source: Next
de: Weiter
hu: Következő

source: Like
de: Gefällt mir
hu: Kedvelem

source: Start Game
de: Spiel starten
hu: Játék indítása

source: Favorites
de: Favoriten
hu: Kedvencek

# noFavorites
source: No favorites yet.
de: Keine Favoriten.
hu: Még nincsenek kedvencek.

# youHaveFavorites
source: You have {count} favorites:
de: Du hast {count} Favoriten:
hu: Önnek {count} kedvence van:

source: History
de: Verlauf
hu: Előzmények

# noHistory
source: No history yet.
de: Kein Verlauf.
hu: Még nincs előzmény.

# youHaveHistory
source: You have {count} history items:
de: Du hast {count} Verlaufe:
hu: Önnek {count} elözmény van:

source: Choose your move:
de: Wähle deinen Zug:
hu: Válassz egy lépést:

source: Playing...
de: Spielen...
hu: Játék folyamatban...

source: It's a draw!
de: Unentschieden!
hu: Döntetlen!

source: You win!
de: Du gewinnst!
hu: Nyertél!

source: You lose!
de: Du verlierst!
hu: Vesztettél!

source: Language
de: Sprache
hu: Nyelv

source: Dark Theme
de: Dunkler Theme
hu: Sötét Téma

source: Use System Theme
de: Verwende System Theme
hu: Rendszer Téma

source: Factory Reset
de: Zurücksetzen
hu: Gyári visszáallítás

source: Legs
de: Legen

source: Target Score
de: Zielpunktzahl
hu: Cél pontszám

source: Double Out
de: Doppelausstieg
hu: Dupla kiszálló

source: Players
de: Spieler
hu: Játékosok

source: Let's play!
de: Los geht's!
hu: Játékra fel

# gameMode
source: Game Mode: {param}
de: Spielmodus: {param}
hu: Játék mód: {param}

# player
source: Player {param}
de: Spieler {param}
hu: Játékos {param}

# invalidPoints
source: Invalid points entered.
de: Ungültige Punkte!
hu: Túl magas pontszám

# editNameTitle
source: Edit Name
de: Name bearbeiten
hu: Név szerkesztése

source: Enter name
de: Gib einen Namen ein
hu: Név megadaása

# emptyName
source: Name cannot be empty.
de: Name darf nicht leer sein!
hu: Név nincs megadva

source: Triple
de: Trippelausstieg
hu: Tripla

source: Double
de: Doppelausstieg
hu: Dupla

source: Double out required.
de: Doppelausstieg erforderlich.
hu: Dupla kiszálló szükséges

# doubleOutMinimumPoints
source: Invalid points for double out.
de: Ungültige Punkte für Doppelausstieg.
hu: Érvénytelen pontszám a dupla kiszállóhoz

source: Press back again to exit
de: Erneut drückenen zum Verlassen
hu: Kilépéshez nyomd meg újra a vissza gombot

# exitTitle
source: Exit
de: Verlassen
hu: Kilépés

# exitMessage
source: Are you sure you want to exit?
de: Möchten Sie wirklich beenden?
hu: Biztosan ki akarsz lépni?

source: Yes
de: Ja
hu: Igen

source: No
de: Nein
hu: Nem

# game_darts_description
source: Hit the bullseye!
de: Treff das Bullseye!
hu: Találd el a célpontot!

# game_darts_long_description
source: Darts is a popular game where players aim to throw small, pointed missiles at a circular target known as a dartboard. The game can be played in various formats, with the most common being 301 and 501. In these modes, players start with a score of 301 or 501, and the goal is to reduce the score to exactly zero by subtracting the points scored with each throw. To finish, the player must hit a double. Cricket is another fun variation where players aim to close specific numbers on the board (15–20) and the bullseye before their opponent. Clock is a game where players must hit each number on the dartboard in numerical order, starting from 1 and finishing with the bullseye. Implementing these modes will allow for exciting two-player matches, and adding statistics can enhance the experience by tracking accuracy, high scores, and the number of darts thrown. This adds depth to gameplay, allowing players to monitor their performance over time.
de: Darts ist ein beliebtes Spiel, bei dem die Spieler versuchen, kleine, spitze Pfeile auf eine kreisförmige Zielscheibe, das sogenannte Dartboard, zu werfen. Das Spiel kann in verschiedenen Formaten gespielt werden, wobei die gängigsten Varianten 301 und 501 sind. In diesen Modi beginnen die Spieler mit einem Punktestand von 301 oder 501, und das Ziel ist es, den Punktestand genau auf null zu reduzieren, indem die mit jedem Wurf erzielten Punkte abgezogen werden. Zum Abschluss muss der Spieler ein Doppelfeld treffen. Cricket ist eine weitere unterhaltsame Variante, bei der die Spieler versuchen, bestimmte Zahlen auf dem Board (15–20) und das Bullseye vor ihrem Gegner zu schließen. Clock ist ein Spiel, bei dem die Spieler jede Zahl auf dem Dartboard in numerischer Reihenfolge treffen müssen, beginnend mit der 1 und endend mit dem Bullseye. Die Implementierung dieser Modi ermöglicht spannende Zwei-Spieler-Matches, und die Hinzufügung von Statistiken kann das Spielerlebnis verbessern, indem Genauigkeit, Höchstpunktzahlen und die Anzahl der geworfenen Darts verfolgt werden. Dies verleiht dem Spiel Tiefe und ermöglicht es den Spielern, ihre Leistung im Laufe der Zeit zu überwachen.
hu: A darts egy népszerű játék, amelyben a játékosok célja, hogy kicsi, hegyes nyilakat dobjanak egy kör alakú célpontra, az úgynevezett dartstáblára. A játék különböző formátumokban játszható, a leggyakoribbak a 301 és az 501. Ezekben a játékmódokban a játékosok 301 vagy 501 ponttal kezdenek, és a cél az, hogy pontosan nullára csökkentsék a pontszámukat az elért pontok levonásával minden dobás után. A befejezéshez a játékosnak egy duplát kell találnia. A Cricket egy másik szórakoztató változat, amelyben a játékosok célja, hogy lezárják a táblán található meghatározott számokat (15-től 20-ig) és a bullseye-t az ellenfelük előtt. A Clock nevű játékban a játékosoknak sorrendben kell eltalálniuk a dartstáblán szereplő összes számot, kezdve az 1-es számmal, és a bullseye-nál befejezve. Ezeknek a játékmódoknak a bevezetése izgalmas kétjátékos mérkőzéseket tesz lehetővé, és a statisztikák hozzáadása fokozhatja az élményt azzal, hogy nyomon követi a pontosságot, a legjobb eredményeket és a dobások számát. Ez mélységet ad a játéknak, lehetővé téve a játékosok számára, hogy idővel figyeljék a teljesítményüket.

# pig_game_title
source: Pig Game
de: Schwein Spiel
hu: Disznó játék

# pig_game_description
source: Roll the dice!
de: Wirf die Würfel!
hu: Dobd el a kockát!

# pig_game_long_description
source: Dice is a two-player game where players take turns rolling a six-sided dice. Each player accumulates points during their turn, adding the dice's value to their current score. If a player rolls a 1, their turn ends, and the other player takes over. Players can choose to hold their score, adding the current score to their total. The first player to reach 100 points wins the game. Careful strategy is required, as rolling a 1 resets the player's current score for that turn!
de: Pig ist ein Zwei-Spieler-Spiel, bei dem die Spieler abwechselnd einen Würfel mit sechs Seiten werfen. Jeder Spieler sammelt während seines Zuges Punkte, indem er den Wert des Würfels zu seinem aktuellen Punktestand hinzufügt. Wenn ein Spieler eine 1 würfelt, endet sein Zug, und der andere Spieler übernimmt. Die Spieler können sich entscheiden, ihre Punkte zu behalten, indem sie den aktuellen Punktestand zu ihrem Gesamtpunktestand hinzufügen. Der erste Spieler, der 100 Punkte erreicht, gewinnt das Spiel. Es ist eine sorgfältige Strategie erforderlich, da das Würfeln einer 1 den aktuellen Punktestand des Spielers für diesen Zug zurücksetzt!
hu: A Pig egy kétjátékos játék, amelyben a játékosok felváltva dobnak egy hatszögletű kockával. Minden játékos a saját sora alatt pontokat gyűjt, hozzáadva a kocka értékét a jelenlegi pontszámukhoz. Ha egy játékos 1-est dob, akkor a sora véget ér, és a másik játékos következik. A játékosok dönthetnek úgy is, hogy megtartják a pontjaikat, és hozzáadják az aktuális pontszámot a teljes eredményükhöz. Az a játékos nyer, aki először éri el a 100 pontot. Gondos stratégia szükséges, mivel a 1-es dobása visszaállítja az adott körben szerzett pontokat!

# game_rps_title
source: Rock-Paper-Scissors
de: Stein-Papier-Schere
hu: Kő-Papír-Olló

# game_rps_description
source: Classic hand game!
de: Klassisches Handspiel!
hu: Klasszikus kézjáték!

# game_rps_long_description
source: Rock-paper-scissors is a simple yet strategic game where two players simultaneously choose one of three options: rock, paper, or scissors. Rock beats scissors, scissors beats paper, and paper beats rock. In your implementation, the player will compete against the computer, adding an element of unpredictability and excitement. To make the game more interesting, you could introduce a hidden mode that unlocks an advanced version: rock-paper-scissors-lizard-Spock. In this version, Spock beats scissors and rock, while lizard beats Spock and paper, adding more complexity and options to the gameplay. This hidden mode could be triggered by a secret combination or a special event, adding an element of surprise for players who discover it. With the computer as the opponent, you can also implement statistics to track the player's win/loss record, favorite moves, and the outcome probability for different choices. This makes the game more engaging and replayable for the user.
de: Schere-Stein-Papier ist ein einfaches, aber strategisches Spiel, bei dem zwei Spieler gleichzeitig eine der drei Optionen wählen: Stein, Papier oder Schere. Stein schlägt Schere, Schere schlägt Papier und Papier schlägt Stein. In Ihrer Implementierung tritt der Spieler gegen den Computer an, was ein Element der Unvorhersehbarkeit und Aufregung hinzufügt. Um das Spiel interessanter zu gestalten, könnten Sie einen versteckten Modus einführen, der eine erweiterte Version freischaltet: Schere-Stein-Papier-Echse-Spock. In dieser Version schlägt Spock Schere und Stein, während Echse Spock und Papier schlägt, was mehr Komplexität und Optionen ins Spiel bringt. Dieser versteckte Modus könnte durch eine geheime Kombination oder ein spezielles Ereignis ausgelöst werden und so ein Überraschungselement für Spieler hinzufügen, die ihn entdecken. Mit dem Computer als Gegner können Sie auch Statistiken implementieren, um die Gewinn/Verlust-Bilanz des Spielers, bevorzugte Züge und die Wahrscheinlichkeiten für verschiedene Entscheidungen zu verfolgen. Dies macht das Spiel für den Benutzer noch ansprechender und wiederholbar.
hu: A kő-papír-olló egy egyszerű, mégis stratégiai játék, ahol két játékos egyszerre választ a három lehetőség közül: kő, papír vagy olló. A kő legyőzi az ollót, az olló legyőzi a papírt, és a papír legyőzi a követ. Az Ön implementációjában a játékos a számítógép ellen fog versenyezni, így egy kis kiszámíthatatlanságot és izgalmat adva a játékhoz. A játék még érdekesebbé tétele érdekében bevezethet egy rejtett módot, amely egy fejlettebb verziót old fel: kő-papír-olló-gyík-Spock. Ebben a verzióban Spock legyőzi az ollót és a követ, míg a gyík legyőzi Spockot és a papírt, még több bonyolultságot és lehetőséget adva a játékmenethez. Ezt a rejtett módot egy titkos kombináció vagy egy különleges esemény indíthatja el, meglepetésként azok számára, akik felfedezik. Mivel a számítógép a játékos ellenfele, statisztikákat is készíthet, amelyek nyomon követik a játékos győzelmeit/veszteségeit, kedvenc mozdulatait és a különböző választások kimeneteleinek valószínűségét. Ez még vonzóbbá és újra játszhatóvá teszi a játékot a felhasználó számára.

# game_namer_title
source: Namer Game
de: Namer Spiel
hu: Szó kombinátor

# game_namer_description
source: It's a simple namer game, with lots of fun!
de: Es ist ein einfaches Namensspiel, mit viel Spaß!
hu: Ez egy egyszerű névadó játék, rengeteg szórakozással!

# game_namer_long_description
source: The word combinator game generates two random words and combines them to create fun and quirky word pairs. Players can mark their favorite word combinations and store them in a favorites list. The game also keeps a history, allowing players to revisit and enjoy previously generated word pairs. Each session is unique, with endless combinations that spark creativity and laughter. The favorites and history features ensure players can easily access and recall their best finds anytime.
de: Das Wortkombinator-Spiel generiert zwei zufällige Wörter und kombiniert sie, um lustige und originelle Wortpaare zu erstellen. Spieler können ihre Lieblingswortkombinationen markieren und in einer Favoritenliste speichern. Das Spiel führt auch eine Historie, sodass die Spieler zuvor generierte Wortpaare erneut ansehen und genießen können. Jede Sitzung ist einzigartig, mit endlosen Kombinationen, die Kreativität und Lachen anregen. Die Favoriten- und Historienfunktionen stellen sicher, dass die Spieler jederzeit problemlos auf ihre besten Funde zugreifen und sich daran erinnern können.
hu: A szavak kombinátor játéka két véletlenszerű szót generál, és összekombinálja őket, hogy szórakoztató és különleges szó párokat hozzon létre. A játékosok megjelölhetik kedvenc szókombinációikat, és elmenthetik őket a kedvencek listájába. A játék emellett egy történetet is vezet, így a játékosok visszanézhetik és élvezhetik az előzőleg generált szó párokat. Minden egyes játék egyedi, végtelen kombinációk révén, amelyek kreativitást és nevetést váltanak ki. A kedvencek és a történet funkciók biztosítják, hogy a játékosok bármikor könnyen hozzáférhessenek és felidézhessék legjobb találataikat.

# game_dice_title
source: Dice
de: Würfel
hu: Bobó kocka

# game_dice_description
source: Roll the dice!
de: Wirf die Würfel!
hu: Dobd el a kockát!

# game_dice_long_description
source: Shake your device to roll the dice and see what you get! This fun and interactive dice game responds to your movements, making every roll feel real. With vibrant graphics and a smooth rolling animation, it’s perfect for quick games or for adding a virtual dice to any tabletop experience. Simply press the button or give your phone a shake to start rolling. Will you get lucky with a six? Try your luck now!
de: Schüttle dein Gerät, um den Würfel zu rollen und zu sehen, was du bekommst! Dieses unterhaltsame und interaktive Würfelspiel reagiert auf deine Bewegungen, wodurch jeder Wurf realistisch wirkt. Mit lebendigen Grafiken und einer flüssigen Wurf-Animation ist es perfekt für schnelle Spiele oder um ein virtuelles Würfeln zu jedem Tischspiel hinzuzufügen. Drücke einfach den Knopf oder schüttle dein Handy, um den Wurf zu starten. Wirst du mit einer Sechs Glück haben? Versuche jetzt dein Glück!
hu: Rázd meg az eszközt, hogy dobj a kockával, és nézd meg, mit kapsz! Ez a szórakoztató és interaktív kockajáték reagál a mozdulataidra, így minden dobás valósághűnek tűnik. Életteli grafikákkal és sima gördülő animációval van megáldva, tökéletes gyors játékokhoz, vagy hogy bármelyik asztali játékhoz virtuális kockát adj. Csak nyomd meg a gombot, vagy rázd meg a telefonod, hogy elkezdődjenek a dobások. Szerencsés leszel és hatost dobsz? Próbáld ki a szerencséd most!

# finalWinnerTitle
source: Final Winner
hu: Végső győztes
